const flagData = [
  {
    id: "china",
    name: "中国",
    path: "https://flagcdn.com/w1280/cn.png",
    flagDetail:
      "中国国旗由红色底面和五颗黄色五角星组成。红色象征着革命，黄色五角星象征着中国共产党领导下的各族人民大团结。国旗上的五颗星中，一颗较大的星代表中国共产党，四颗较小的星环绕在大星的右侧，代表工人阶级、农民阶级、城市小资产阶级和民族资产阶级，这四个社会阶级在中国共产党的领导下团结起来。",
    nationDetail: `中华人民共和国（the People's Republic of China），简称“中国”，成立于1949年10月1日  ，位于亚洲东部，太平洋西岸  ，是工人阶级领导的、以工农联盟为基础的人民民主专政的社会主义国家  ，以五星红旗为国旗  、《义勇军进行曲》为国歌  ，国徽中间是五星照耀下的天安门，周围是谷穗和齿轮  ，通用语言文字是普通话和规范汉字  ，首都北京  ，是一个以汉族为主体、56个民族共同组成的统一的多民族国家。
中国陆地面积约960万平方千米，东部和南部大陆海岸线1.8万多千米，海域总面积约473万平方千米  。海域分布有大小岛屿7600多个，其中台湾岛最大，面积35798平方千米  。中国同14国接壤，与8国海上相邻。省级行政区划为23个省、5个自治区、4个直辖市、2个特别行政区。  
中国是世界上历史最悠久的国家之一，有着光辉灿烂的文化和光荣的革命传统  ，世界遗产数量全球领先  。1949年新中国成立后，进入社会主义革命和建设时期，1956年实现向社会主义过渡，此后社会主义建设在探索中曲折发展。“文化大革命”结束后实行改革开放，沿着中国特色社会主义道路，集中力量进行社会主义现代化建设  。经过长期努力，中国特色社会主义进入了新时代。  
中国是世界上人口最多的发展中国家，国土面积居世界第三位，是世界第二大经济体，并持续成为世界经济增长最大的贡献者，2020年经济总量突破100万亿元。中国坚持独立自主的和平外交政策，是联合国安全理事会常任理事国，也是许多国际组织的重要成员，被认为是潜在超级大国之一。`,
    baidu_online: "https://baike.baidu.com/item/中华人民共和国",
    wiki_online:
      "https://zh.wikipedia.org/zh-cn/%E4%B8%AD%E5%8D%8E%E4%BA%BA%E6%B0%91%E5%85%B1%E5%92%8C%E5%9B%BD"
  },
  {
    id: "india",
    name: "印度",
    path: "https://flagcdn.com/w1280/in.png",
    flagDetail:
      "印度国旗是国家的象征，设计简洁而富有深刻含义。国旗呈长方形，长宽比例为3:2，自上而下分为橙、白、绿三个相等的横长方形条纹。在白色的条纹中心，描绘有一个24根轴条的蓝色法轮（称为“阿育王法轮”或“真理之轮”）。橙色代表勇气、献身与无私，白色象征纯洁和真理，绿色则表示生命、信心与人类的生产力。法轮是神圣、真理和进步的象征，其24根轴条代表着一天中的24小时，也象征着生活的不断前进和国家的持久真理。",
    nationDetail: `印度，全称为印度共和国（Republic of India），是南亚次大陆上最大的国家，拥有悠久的历史、丰富的文化多样性和庞大的人口基础。印度是世界上人口第二多的国家，官方语言为印地语和英语，其首都为新德里。印度北部与中国、尼泊尔、不丹、孟加拉国和缅甸接壤，东部与孟加拉国和缅甸相连，西部与巴基斯坦接壤，南部濒临印度洋，东濒孟加拉湾，西临阿拉伯海。`,
    baidu_online: "https://baike.baidu.com/item/印度"
  },
  {}
];

export { flagData };
